# 선수들 통계에서 타율, 안타수, 타수, 타석, 볼넷, 데드볼을 알고 있을 경우 희생타를 구하는 방법
# KBO 전체시즌 타율 상위 10인


player <- c('이정수', '장효조', '박건우', '손아섭', '김태균', '박민우', '양준혁', '나성범', '구자욱', '김현수')
AVG <- c(0.340, 0.330, 0.326, 0.322, 0.320, 0.320, 0.316, 0.315, 0.315, 0.314)
H <- c(1181, 1008, 1303, 2416, 2209, 1332, 2318, 1591, 1326, 2236)
AB <- c(3476,3050,3996,7500,6900,4168,7332,5044,4206,7110)
PA <- c(3947, 3632, 4518, 8521, 8225, 4813, 8807, 5665, 4739, 8249)
BB <- c(383, 506, 376, 909, 1141, 448, 1278, 455, 423, 967)
HBP <- c(39, 27, 80, 40, 108, 104, 102, 120, 54, 64)

# AVG =  H / AB ( PA - SF - BB - HBP )

names(AVG) <- player
names(H) <- player
names(AB) <- player
names(PA) <- player
names(BB) <- player
names(HBP) <- player

name <- '박건우'

SF <- -(AVG[name] * AB[name] / H[name] - PA[name] + BB[name] + HBP[name])


SF

# 타율 avg 
# 안타수 H 
# 타수 AB 
# 타석 PA  
# 볼넷 BB 
# 데드볼 HBP